In [1]:
import pandas as pd

In [2]:
# List of high schools

high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

print (high_schools)

['Hernandez High School', 'Figueroa High School', 'Wilson High School', 'Wright High School']

In [3]:
# List of high schools

high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [4]:
# A dictionary of high schools and the type of school.

high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]
high_school_types

[{'High School': 'Griffin', 'Type': 'District'},
 {'High School': 'Figueroa', 'Type': 'District'},
 {'High School': 'Wilson', 'Type': 'Charter'},
 {'High School': 'Wright', 'Type': 'Charter'}]

# Create list to dictionary :

In [5]:
# Three separate lists of information on high schools


school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

# list to dictionary.

high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

high_schools_dict

{'School ID': [0, 1, 2, 3, 4],
 'school_name': ['Huang High School',
  'Figueroa High School',
  'Shelton High School',
  'Hernandez High School',
  'Griffin High School'],
 'type': ['District', 'District', 'Charter', 'District', 'Charter']}

# Create dataframe from different lists :---

In [6]:
# different list to  one dataframe


school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]


list(zip(school_id,school_name,type_of_school))



# Add the list to a new DataFrame.
school_df = pd.DataFrame (list(zip(school_id,school_name,type_of_school)), columns = ["School ID","school_name","type"] )
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

# Another way of different list to dataframe :

In [7]:
list1 = ["Foreign Cinema", 50]
list2 = ["Liho Liho", 45]
list3 = ["500 Club", 102]
list4 = ["The Square", 65]

pd.DataFrame(data=[list1, list2, list3, list4], columns=['Name', 'num_customers'])

             Name  num_customers
0  Foreign Cinema             50
1       Liho Liho             45
2        500 Club            102
3      The Square             65